Revit 2027 API
CompoundStructure.ChangeRegionWidth Method
 Adjust the width of an existing simple region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ChangeRegionWidth(
	int regionId,
	double newWidth
)
Public Function ChangeRegionWidth (
	regionId As Integer,
	newWidth As Double
) As Boolean
public:
bool ChangeRegionWidth(
	int regionId,
	double newWidth
)
member ChangeRegionWidth :
        regionId : int *
        newWidth : float -> bool
Parameters
regionId Int32
 The id of a region.
newWidth Double
 The desired width of the specified region.
Return Value
Boolean
 True if newWidth is zero and the region was deleted.
Exceptions
Exception | Condition
ArgumentException |  It is not a valid region id. -or- It is not a simple region.
InvalidOperationException |  This operation is valid only for vertically compound structures.
Remarks
 If width is changed to zero, the effect is to delete the region.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace